common/models/AdminLog.php

INSERT INTO `sys_admin_log` (`agent`, `username`, `mark`, `module`, `controller`, `action`, `create_time`, `description`) VALUES (3, '13818813547', '修改投递记录', 'app-gm', 'data', 'delivery-detail-edit', '2020-12-07 15:19:02', '运营商: 小松鼠 修改投递记录id为: 659196 将品类 纸类回收 修改为: 纸类回收 将重量 0.01 修改为: 10 修改后的收益为: 4')
---
    public function addLog($mark,$description)
    {
        $action = Yii::$app->controller->action->id;
        $module = Yii::$app->controller->module->id;
        $controller = Yii::$app->controller->id;
        $id = Yii::$app->user->identity->id;//操作人员id
        $userName = Yii::$app->user->identity->username;//操作人员名
        $time = date('Y-m-d H:i:s');
        $data['SysAdminLog'] = [
            'agent' => $id,
            'username' => $userName,
            'mark' => $mark,
            'module' => $module,
            'controller' => $controller,
            'action' => $action,
            'create_time' => $time,
            'description' => $description
        ];
        $model = new SysAdminLog();

        $model->load($data);
        $model->save();