common/models/Agent.php

SELECT * FROM `sr_agent` WHERE (`id`='3') AND (`status`=10)
---
    public static function findIdentity($id)
    {
        return static::findOne(['id' => $id, 'status' => self::STATUS_ACTIVE]);