common/models/Category.php

    public function getCategoryList($where)
    {
        $data = SrRubbishCategory::find()
                ->select('id,category_name,rubbish_unit')
                ->asArray()
                ->where($where)
                ->all();
---
SELECT `id`, `category_name`, `rubbish_unit` FROM `sr_rubbish_category` WHERE `id` IN ('5', '1', '2', '5', '7', '2', '2', '5', '5', '1')

    public function getCategory($where)
    {
        $data = SrRubbishCategory::find()
            ->select('id,category_name,rubbish_unit')
            ->asArray()
            ->where($where)
            ->one();
---
SELECT `id`, `category_name`, `rubbish_unit` FROM `sr_rubbish_category` WHERE `id`='2'