common/models/Machine.php

    public function getMachineList($where)
    {
        $data = SrRecyclingMachine::find()
            ->select('id, community_name,device_id,position_village_id,street_name')
            ->where($where)
            ->asArray()
            ->all();
---
SELECT `id`, `community_name`, `device_id`, `position_village_id`, `street_name` FROM `sr_recycling_machine` WHERE `id` IN ('33', '71', '98', '98', '36', '71', '36', '36', '71', '27')