common/models/Maintain.php

    public function getMaintainList($where)
    {
         $data = SrMaintain::find()
                ->select('id,nick_name,phone_num,agent,type,maintain_status')
                ->where($where)
                ->asArray()
                ->all();
---
SELECT `id`, `nick_name`, `phone_num`, `agent`, `type`, `maintain_status` FROM `sr_maintain` WHERE `id` IN ('3', '3', '3', '3', '4', '3', '3', '3', '4', '4')