common/models/Recycler.php

    public function getRecyclerList($where)
    {
        $data = SrRecycler::find()
                ->select('id,nick_name,phone_num,agent,type')
                ->where($where)
                ->asArray()
                ->all();
---
SELECT `id`, `nick_name`, `phone_num`, `agent`, `type` FROM `sr_recycler` WHERE `id` IN ('54', '64', '35', '35', '35', '64', '35', '35', '64', '42')