common/models/TrashCan.php

    public function getTrashCan($where)
    {
        $data = SrTrashCan::find()
            ->select('id,machine_id,category,recycle_price,can_num,can_name,activity_status,activity_price,count,max_count,weight,max_weight')
            ->where($where)
            ->asArray()
            ->one();
---
SELECT `id`, `machine_id`, `category`, `recycle_price`, `can_num`, `can_name`, `activity_status`, `activity_price`, `count`, `max_count`, `weight`, `max_weight` FROM `sr_trash_can` WHERE `id`='655'