common/models/UserDeliveryHistory.php

    public function getChild($where)
    {
        $child = SrUserDeliveryHistoryChild::find()
            ->select('id, delivery_type,can_name,delivery_count,declarable_status,delivery_income, user_id,machine_id,parent_id')
            ->where($where)
            ->asArray()
            ->one();
---
SELECT `id`, `delivery_type`, `can_name`, `delivery_count`, `declarable_status`, `delivery_income`, `user_id`, `machine_id`, `parent_id` FROM `sr_user_delivery_history_child` WHERE `id`='659196'