common/models/Users.php

    public function getUserList($where)
    {
        $data = SrUser::find()
            ->select('id,nick_name, phone_num')
            ->where($where)
            ->andWhere(['del_flag'=>0])
            ->asArray()
            ->all();
---
SELECT `id`, `nick_name`, `phone_num` FROM `sr_user` WHERE (`id` IN ('43133', '5811', '29915', '29915', '29915', '29915', '29915', '413', '413', '29915')) AND (`del_flag`=0)

    public function getUser($where)
    {
        $data = SrUser::find()
            ->select('id,nick_name, phone_num,user_status,remarks')
            ->where($where)
            ->asArray()
            ->one();
---
SELECT `id`, `nick_name`, `phone_num`, `user_status`, `remarks` FROM `sr_user` WHERE `id`='43133'