gm/controllers/DataController.php


            $transaction = yii::$app->db->beginTransaction();
            try {
                $child = SrUserDeliveryHistoryChild::updateAll([
                    'delivery_type' => $trashCan['category'], 'delivery_income' => $delivery_income,
                    'delivery_count' => $delivery_count, 'can_name' => $trashCan['can_name'],
                    'update_date' => $time
                ], ['id' => $id]);
                $History = SrUserIncomeHistory::updateAll(
                    ['income_amount' => $delivery_income, 'update_date' => $time],
                    ['source_id' => $historyChild['parent_id'], 'source_code' => 'delivery']
                );

                //父表记录减去历史金额
                $income = bcsub($delivery_income, $delivery_old, 2);
                $Parent = SrUserDeliveryHistoryParent::updateAllCounters(
                    ['income_amount' => $income],
                    ['id' => $historyChild['parent_id']]
                );

                //减少的垃圾桶数据
                $old_Statistics = SrUserUsageStatistics::updateAllCounters($old_UserEdit, ['user_id' => $historyChild['user_id']]);
                //添加的垃圾桶增加数据
                $Statistics = SrUserUsageStatistics::updateAllCounters($UserEdit, ['user_id' => $historyChild['user_id']]);
---
UPDATE `sr_user_delivery_history_child` SET `delivery_type`=2, `delivery_income`='4', `delivery_count`='10', `can_name`='纸类回收', `update_date`='2020-12-07 15:19:02' WHERE `id`='659196'
UPDATE `sr_user_income_history` SET `income_amount`='4', `update_date`='2020-12-07 15:19:02' WHERE (`source_id`='456153') AND (`source_code`='delivery')
UPDATE `sr_user_delivery_history_parent` SET `income_amount`=`income_amount`+'4.00' WHERE `id`='456153'
UPDATE `sr_user_usage_statistics` SET `number_of_delivery`=`number_of_delivery`+0, `cumulative_weight`=`cumulative_weight`+-0.01 WHERE `user_id`='43133'
UPDATE `sr_user_usage_statistics` SET `number_of_delivery`=`number_of_delivery`+0, `cumulative_weight`=`cumulative_weight`+'10' WHERE `user_id`='43133'

            ->count();

        $uid = array_column($UserRel,'user_id');
        $srUser = SrUser::find()
            ->select('id, nick_name, phone_num, user_status,open_id, create_date,update_date,remarks')
            ->where(['id'=>$uid])
            ->asArray()
            ->all();
---
SELECT `id`, `nick_name`, `phone_num`, `user_status`, `open_id`, `create_date`, `update_date`, `remarks` FROM `sr_user` WHERE `id` IN ('43152', '43151', '43149', '43148', '43144', '43143', '43142', '43140', '43137', '43136')

    public function actionAjax_account()
    {
        //获取账户余额
        $balance = $this->user['balance'];
        $where = ['a.agent' => $this->agent_id, 'b.order_status' => 1];

        if ($this->user['admin'] === 0) {
            $balance = Agent::find()
                ->select(["IFNULL(SUM(balance), 0) AS balance"])
                ->asArray()
                ->one()['balance'];
            $where = ['b.order_status' => 1];
        }

        //获取累计发放环保金
        $andWhere = ['>', 'a.withdraw_id', 1];
        $res = SrUserDeliveryHistoryChild::find()
            ->select(["IFNULL(SUM(delivery_income), 0) AS income"])
            ->from(SrUserDeliveryHistoryChild::tableName() . ' AS a')
            ->leftJoin(SrUserWithdrawOrder::tableName() . ' AS b', 'a.withdraw_id = b.id')
            ->where($where)
            ->andWhere($andWhere)
            ->asArray()
            ->one();
---
SELECT IFNULL(SUM(balance), 0) AS balance FROM `sr_agent`
SELECT IFNULL(SUM(delivery_income), 0) AS income FROM `sr_user_delivery_history_child` `a` LEFT JOIN `sr_user_withdraw_order` `b` ON a.withdraw_id = b.id WHERE (`b`.`order_status`=1) AND (`a`.`withdraw_id` > 1)

    public function actionAjax_category()
    {
        //查询可计算品类
        $srRubbishCategory = SrRubbishCategory::find()
            ->select('id, category_name')
            ->where(['category_type' => 0])->asArray()->all();
---
SELECT `id`, `category_name` FROM `sr_rubbish_category` WHERE `category_type`=0

            ->groupBy('date')->asArray()->all();

        //投递重量
        $weight = SrUserDeliveryHistoryChild::find()
            ->select(["SUM(delivery_count) AS count, DATE_FORMAT(delivery_time, '%Y-%m-%d') AS date"])
            ->where($where)->andWhere($andWhere)->andWhere(['!=', 'delivery_type', 1])
            ->groupBy('date')->asArray()->all();

        //清运重量
        $recycle = SrRecyclingHistoryChild::find()
            ->select(["COUNT(*) AS count, DATE_FORMAT(create_date, '%Y-%m-%d') AS date"])
            ->where($where)->andWhere($andWhere)->andWhere(['!=', 'category', 1])
            ->groupBy('date')->asArray()->all();
---
SELECT SUM(delivery_count) AS count, DATE_FORMAT(delivery_time, '%Y-%m-%d') AS date FROM `sr_user_delivery_history_child` WHERE (`create_date` BETWEEN '2020-11-30 00:00:00' AND '2020-12-06 23:59:59') AND (`delivery_type` != 1) GROUP BY `date`
SELECT COUNT(*) AS count, DATE_FORMAT(create_date, '%Y-%m-%d') AS date FROM `sr_recycling_history_child` WHERE (`create_date` BETWEEN '2020-11-30 00:00:00' AND '2020-12-06 23:59:59') AND (`category` != 1) GROUP BY `date`