gm/controllers/ManagerController.php

SELECT `a`.`id`, `a`.`create_time`, `b`.`uuid`, `b`.`company_name`, `b`.`mobile`, `a`.`bank_name`, `a`.`amount`, `b`.`balance`, `a`.`status`, `a`.`verify`, `a`.`check` FROM `sr_agent_trade_history` `a` LEFT JOIN `sr_agent` `b` ON a.agent = b.id WHERE `a`.`type`=1 ORDER BY `a`.`id` DESC LIMIT 10
SELECT COUNT(*) FROM `sr_agent_trade_history` `a` LEFT JOIN `sr_agent` `b` ON a.agent = b.id WHERE `a`.`type`=1
---
    public function actionAjax_recharge_list(){
        //获取页码与数据长度
        $offset = empty($_GET['start']) ? 0 : $_GET['start'];
        $length = empty($_GET['length']) ? 10 : $_GET['length'];
        //获取状态
        $status = yii::$app->request->get('status');
        $company_name = yii::$app->request->get('company_name');

        //组装条件
        $where = $andWhere = [];
        $this->user_admin && $where['a.agent'] = $this->agent_id;
        $where['a.type'] = 1;
        $status != '' && $where['a.status'] = $status;
        $company_name != '' && $andWhere = ['or',['LIKE', 'b.company_name', $company_name],['LIKE', 'b.mobile', $company_name]];

        //查询数据
        $res = SrAgentTradeHistory::find()
            ->select(['a.id', 'a.create_time', 'b.uuid', 'b.company_name', 'b.mobile', 'a.bank_name', 'a.amount', 'b.balance', 'a.status', 'a.verify', 'a.check'])
            ->from(SrAgentTradeHistory::tableName() . ' AS a')
            ->leftJoin(Agent::tableName() . ' AS b', 'a.agent = b.id')
            ->where($where)->andWhere($andWhere);
        $srAgentTradeHistory = $res->orderBy(['a.id' => SORT_DESC])
            ->offset($offset)->limit($length)
            ->asArray()->all();
        $total = $res->count();