gm/controllers/RecyclerController.php

    public function actionAjax_recycler_list()
    {
        //获取页码与数据长度
        list($start,$length) = $this->getOffset();
        $recycler_id = yii::$app->request->get('recycler_id');
        $village_id = yii::$app->request->get('village_id');
        $device_id = yii::$app->request->get('device_id');
        $where['m.del_flag'] = 0;
        $where['r.del_flag'] = 0;
        empty($recycler_id) || $where['r.recycler_id']   = $recycler_id;
        empty($village_id) || $where['m.position_village_id'] = $village_id;
        empty($device_id) || $where['m.device_id'] = $device_id;
        $this->user_admin && $where['agent'] = $this->agent_id;
        //机器
        $machine = SrRecyclingMachine::find()
            ->alias('m')
            ->select('m.device_id,m.community_name,m.location,r.recycler_id')
            ->join('LEFT JOIN', 'sr_recycler_machine_rel as r', 'm.id = r.machine_id')
            ->where($where)
            ->offset($start)
            ->limit($length)
            ->orderBy('m.id desc')
            ->asArray()
            ->all();
        //获取记录总数
        $total = SrRecyclingMachine::find()
            ->alias('m')
            ->join('LEFT JOIN', 'sr_recycler_machine_rel as r', 'm.id = r.machine_id')
            ->where($where)
            ->asArray()
            ->count();
---
SELECT `m`.`device_id`, `m`.`community_name`, `m`.`location`, `r`.`recycler_id` FROM `sr_recycling_machine` `m` LEFT JOIN `sr_recycler_machine_rel` `r` ON m.id = r.machine_id WHERE (`m`.`del_flag`=0) AND (`r`.`del_flag`=0) ORDER BY `m`.`id` DESC LIMIT 10
SELECT COUNT(*) FROM `sr_recycling_machine` `m` LEFT JOIN `sr_recycler_machine_rel` `r` ON m.id = r.machine_id WHERE (`m`.`del_flag`=0) AND (`r`.`del_flag`=0)