gm/controllers/SiteController.php

SELECT COUNT(*) FROM `sr_user_delivery_history_abnormal`
---
    public function actionIndex()
    {
        $total = SrUserDeliveryHistoryAbnormal::find()
            ->count();